Center Tendency(finding midpoint)1.Mean(AverageValue)
                                 2.Mode(repeated value)
                                 3.median(exact center value)

In [1]:
#import lib
import pandas as pd

In [2]:
#load dataset
dataset=pd.read_csv('Placement.csv')
dataset.head()

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0

In [3]:
#finding mean,mode,median
dataset['ssc_p'].median()

67.0

In [4]:
dataset['ssc_p'].mean()

67.30339534883721

In [5]:
dataset['ssc_p'].mode()[0]

62.0

In [6]:
from univariate import univariate

In [7]:
obj=univariate()

In [8]:
obj.quanqual(dataset)

(['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary'],
 ['gender',
  'ssc_b',
  'hsc_b',
  'hsc_s',
  'degree_t',
  'workex',
  'specialisation',
  'status'])

In [10]:
#creating quan,qual 2 variables and assigning obj.functionName
quan,qual=obj.quanqual(dataset)

In [11]:
quan

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']

In [12]:
qual

['gender',
 'ssc_b',
 'hsc_b',
 'hsc_s',
 'degree_t',
 'workex',
 'specialisation',
 'status']

In [23]:
#creating table index as mean,mode,median and its respective columns
dataset2=pd.DataFrame(index=['Mean','Median','Mode'])

In [24]:
dataset2
#index created

Empty DataFrame
Columns: []
Index: [Mean, Median, Mode]

In [25]:
#Assinging respestiveColumns
dataset2=pd.DataFrame(index=['Mean','Median','Mode'],columns=quan)

In [26]:
dataset2

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean     NaN   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [27]:
#To access particular cell...use [columnname][indexName]
dataset2['sl_no']['Mean']

nan

In [28]:
# giving value 0 to particular cell 
dataset2['sl_no']['Mean']=0

In [29]:
dataset2

       sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean       0   NaN   NaN      NaN     NaN   NaN    NaN
Median   NaN   NaN   NaN      NaN     NaN   NaN    NaN
Mode     NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [35]:
dataset['sl_no'].mean()

108.0

In [38]:
for colname in quan:
    dataset2[colname]["Mean"]=dataset[colname].mean()
    dataset2[colname]["Median"]=dataset[colname].median()
    dataset2[colname]["Mode"]=dataset[colname].mode()[0]

In [39]:
dataset2

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0
Mode,1,62.0,63.0,65.0,60.0,56.7,300000.0